# Packet Tracer - Implement Port Security

## Part 1: Configure Port Security

S1(config)# interface range f0/1 â€“ 2  
S1(config-if-range)# switchport port-security  
S1(config-if-range)# switchport port-security maximum 1  
S1(config-if-range)# switchport port-security mac-address  sticky  
S1(config-if-range)# switchport port-security violation restrict  
S1(config-if-range)# interface range f0/3 - 24 , g0/1 - 2  
S1(config-if-range)# shutdown  

## Part 2: Verify Port Security

PC1  
C:\>ping 10.10.10.11  
C:\>ipconfig /all

S1# show run | begin interface  
S1# show port-security  
S1# show port-security address

Rogue Laptop straight SI F0/3

S1(config)#int f0/3
S1(config-if)#no shut

Rogue laptop  
C:\>ping 10.10.10.10  
C:\>ping 10.10.10.11

S1(config-if)#shut

Rogue laptop  
C:\>ping 10.10.10.10

S1# show port-security interface f0/2  
6 Violations occured.

PC2  
C:\>ping 10.10.10.10  
PC2 is able to PC1 because we used the sticky configuration to store the mac-address of PC2 and limited the amount of saved mac-addresses to 1. When the rogue laptop tried to connect the mac-address wasn't the same nor could it be stored thus it could do nothing.
