# Packet Tracer - Basic Router Configuration Review

## Part 1: Configure Devices and Verify Connectivity

### Step 1: Configure the PC interfaces

PC3  
Desktop -> IP Configuration  
IP Address: 10.0.4.10  
Subnet Mask: 255.255.255.0  
Default Gateway: 10.0.4.1  
IPv6 Address: 2001:db8:acad:4::10 / 64  
IPv6 Gateway: fe80::2:a

PC4  
Desktop -> IP Configuration  
IP Address: 10.0.5.10  
Subnet Mask: 255.255.255.0  
Default Gateway: 10.0.5.1  
IPv6 Address: 2001:db8:acad:5::10 / 64  
IPv6 Gateway: fe80::2:b  

### Step 2: Configure the router

```Packet tracer
Router(config)#hostname R2
R2(config)#enable secret c1sco1234
R2(config)#ip domain-name ccna-lab.com
R2(config)#no ip domain-lookup
R2(config)#service password-encryption
R2(config)#username SSHadmin
R2(config)#username SSHadmin secret 55Hadm!n
R2(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
R2(config)#line con 0
R2(config-line)#password cisco
R2(config-line)#login
R2(config-line)#exec-timeout 6 0
R2(config-line)#logging synchronous
R2(config)#line vty 0 15
R2(config-line)#password cisco
R2(config-line)#transport input ssh
R2(config-line)#exec-timeout 6 0
R2(config-line)#login local
R2(config)#banner motd "Warning unauthorized access is prohibited!"
R2(config)#ipv6 unicast-routing
```

>**Note:** the banner is not correct unless it contains the word warning.

```Packet tracer
R2(config)#interface g0/0/0
R2(config-if)#description Connects to S3
R2(config-if)#ip address 10.0.4.1 255.255.255.0
R2(config-if)#ipv6 address 2001:db8:acad:4::1/64
R2(config-if)#ipv6 address fe80::2:a link-local
R2(config-if)#no shut
R2(config-if)#int g0/0/1
R2(config-if)#description Connects to S4
R2(config-if)#ip address 10.0.5.1 255.255.255.0
R2(config-if)#ipv6 address 2001:db8:acad:5::1/64
R2(config-if)#ipv6 address fe80::2:b link-local
R2(config-if)#no shut
R2(config-if)#int S0/1/0
R2(config-if)#description Connects to R1
R2(config-if)#ip address 10.0.3.2 255.255.255.0
R2(config-if)#ipv6 address 2001:db8:acad:3::2/64
R2(config-if)#ipv6 address fe80::1:c link-local
R2(config-if)#no shut
R2(config)#int s0/1/1
R2(config-if)#description Connects to the internet
R2(config-if)#ip address 209.165.200.225 255.255.255.252
R2(config-if)#ipv6 address 2001:db8:feed:224::1/64
R2(config-if)#ipv6 address fe80::1:d link-local
R2(config-if)#no shutdown
R2#copy running-config startup-config
```

>**Note:** R2#show run is a blessing, use it to verify that you have configured your network correctly!

### Step 3: Verify network connectivity

PC3  
C:\>ping 10.0.5.10  
C:\>ping 2001:db8:acad:5::10  
These pings are successful!

```Packet tracer
R2#ping 10.0.3.1
R2#ping 2001:db8:acad:3::1
```

These pings are successful!

PC3  
C:\>ping 64.100.1.1  
C:\>ping 2001:db8:acad:5::10  
These pings are successful!  

## Part 2: Display Router Information

### Step 1: Establish an SSH session to R2

PC3  
C:\>ssh -l SSHadmin 10.0.4.1  
Password: 55Hadm!n  
The pings are not successful but the remote access was.

### Step 2: Retrieve important hardware and software information

>**Note:** The following commands are from the ssh session on pc3 to the router.

```Packet tracer
R2>show version
R2>show version | include IOS
```

Cisco IOS XE Software. 32768K bytes of non-volatile configuration memory. 3223551K bytes of flash memory at bootflash.

```Packet tracer
R2>show version | include register
```

Configuration register is 0x2102.

### Step 3: Display the running configuration

```Packet tracer
R2>en
Password: c1sco1234
R2#show running-config | include password
R2#show running-config | begin vty
R2#show running-config | section vty
```

There are 3 passwords in the output. It shows line vty 0 4 and 5 15 seperately. After looking this up the reason is for backwards compatibility. Old devices used to only have 0 4 but now there can be up to 16 connections.

>**Note:** Section is supported in packet tracer, unlike the document says.

### Step 4: Display the routing table on the router

```Packet tracer
R2#show ip route
```

The connected routes with the different options. There are 4 route entries coded with a C.

### Step 5: Display a summary list of the interfaces on the router

```Packet tracer
R2#show ip interface brief
R2#show ip int brief | include assigned
R2#show ipv6 int brief
```

Shutdown is the command to change that status. Up/up depend on what layer they are part off. the first is layer 1, the second layer 2.
