# Part 1: Build the Network and Configure Basic  Device Settings
Take 2 2960 switches and connect them with a copper cross cable on F0/1 and F0/1
Add a pc and connect it to S1 with a copper straight through cable on F0/6
Add a pc and connect it to S2 with a copper straight through cable on F0/18

S1
Switch> enable
Switch# conf t
S1(config) # hostname S1
S1(config) # no ip domain-lookup (to test this show run | include domain-lookup)
S1(config) # enable secret class
S1(config) # line con 0
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # line vty 0 15
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # exit
S1(config) # service password-encryption
S1(config) # banner motd A
Unauthorized access is prohibited! A
S1(config) # interface vlan 1
S1(config-if) # ip address 192.168.1.11 255.255.255.0
S1(config-if) # no shutdown
S1(config-if) # exit
S1(config) # clock timezone UTC 1
S1(config) # exit
S1# copy running-config startup-config

S2
Switch> enable
Switch# conf t
S2(config) # hostname S2
S2(config) # no ip domain-lookup
S2(config) # enable secret class
S2(config) # line con 0
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # line vty 0 15
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # exit
S2(config) # service password-encryption
S2(config) # banner motd A
Unauthorized access is prohibited! A
S2(config) # interface vlan 1
S2(config-if) # ip address 192.168.1.11 255.255.255.0
S2(config-if) # no shutdown
S2(config-if) # exit
S2(config) # clock timezone UTC 1
S2(config) # exit
S2# copy running-config startup-config

PC-A
Desktop -> IP-configuration
IP-address: 192.168.10.3
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.10.1

PC-B
Desktop -> IP-configuration
IP-address: 192.168.10.4
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.10.1

Can  PC-A  ping  PC-B? yes
Can PC-A  ping  S1? No
Can  PC-B  ping  S2? No
Can  S1 ping  S2? Yes 
Because they're not in the same subnet

# Part 2: Create VLANs  and Assign  Switch Ports
S1(config)# vlan 10
S1(config-vlan)#name Operations
S1(config-vlan)#vlan 20
S1(config-vlan)#name Parking_Lot
S1(config-vlan)#vlan 99
S1(config-vlan)#name Management
S1(config-vlan)# vlan 1000
S1(config-vlan)# name Native
S1(config-vlan)#end

S2(config)# vlan 10
S2(config-vlan)#name Operations
S2(config-vlan)#vlan 20
S2(config-vlan)#name Parking_Lot
S2(config-vlan)#vlan 99
S2(config-vlan)#name Management
S2(config-vlan)# vlan 1000
S2(config-vlan)# name Native
S2(config-vlan)#end

show vlan brief
What is the default vlan? vlan 1
What ports are  assigned  to the default  VLAN? All ports

S1(config)# interface f0/6
S1(config-if)# switchport mode access
S1(config-if)#switchport access vlan 10
S1(config)#interface vlan 1
S1(config-if)#no ip address
S1(config-if)#interface vlan 99
S1(config-if)#ip address 192.168.1.11 255.255.255.0
S1(config-if)# end

S2(config)# interface f0/6
S2(config-if)# switchport mode access
S2(config-if)#switchport access vlan 10
S2(config)#interface vlan 1
S2(config-if)#no ip address
S2(config-if)#interface vlan 99
S2(config-if)#ip address 192.168.1.12 255.255.255.0
S2(config-if)# end

# Part 3: Maintain VLAN  Port Assignments  and the VLAN Database
S1(config)# interface range f0/11-24
S1(config-if-range)# switchport mode access
S1(config-if-range)# switchport access vlan 99
S1(config-if-range)# end
show  vlan brief
S1(config)# interface f0/11
S1(config-if-range)# switchport mode access
S1(config-if-range)# switchport access vlan 10
S1(config-if-range)# end
S1(config)# interface f0/23
S1(config-if-range)# switchport mode access
S1(config-if-range)# switchport access vlan 10
S1(config-if-range)# end

S1(config)# interface f0/24
S1(config-if)# no switchport access vlan
S1(config-if)# end
Which VLAN is F0/24 now  associated with? The default, vlan 1

S1(config)# interface f0/24
S1(config-if)# switchport access vlan 30
S1(config-if)# end
What is the default  name  of  VLAN  30? VLAN0030

S1(config)# no vlan 30
S1(config)# end
After  deleting  VLAN  30 from  the VLAN  database,  what  VLAN is port F0/24  assigned  to? No port

S1(config)#interface fastEthernet 0/24
S1(config-if)#no switchport access vlan
S1(config-if)#end
To  which  VLAN  is F0/24  assigned? VLAN 1

# Part 4: Configure  an 802.1Q  Trunk  Between  the Switches
S1(config)#interface f0/1
S1(config-if)#switchport mode dynamic desirable # Part 5: Delete the VLAN  Database

S1# show interfaces trunk
S2# show interfaces trunk
Can  S1 ping  S2? Yes
Can  PC-A  ping  PC-B? yes 
Can  PC-A  ping  S1? No 
Can  PC-B  ping S2? No
Because the switches are trunked and the pc's are not trunked on vlnan

S1(config)# interface f0/1
S1(config-if)# switchport mode trunk
S2# show interfaces trunk

S1(config)# interface f0/1
S1(config-if)# switchport trunk native vlan 1000
S2(config)# interface f0/1
S2(config-if)# switchport trunk native vlan 1000
# Part 5: Delete the VLAN Database
S1#show flash
S1# delete vlan.dat