# Part 1: Build the Network and Configure Basic Device Settings
Take 2 2960 switches and connect them with a copper cross cable on F0/1 and F0/1
Add a pc and connect it to S1 with a copper straight through cable on F0/6
Add a pc and connect it to S2 with a copper straight through cable on F0/18

S1
Switch> enable
Switch# conf t
S1(config) # hostname S1
S1(config) # no ip domain-lookup (to test this show run | include domain-lookup)
S1(config) # enable secret class
S1(config) # line con 0
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # line vty 0 15
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # exit
S1(config) # service password-encryption
S1(config) # banner motd A
Unauthorized access is prohibited! A
S1# copy running-config startup-config

S2
Switch> enable
Switch# conf t
S2(config) # hostname S2
S2(config) # no ip domain-lookup
S2(config) # enable secret class
S2(config) # line con 0
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # line vty 0 15
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # exit
S2(config) # service password-encryption
S2(config) # banner motd A
Unauthorized access is prohibited! A
S2# copy running-config startup-config

PC-A
Desktop -> IP-configuration
IP-address: 192.168.20.13
Subnet Mask: 255.255.255.0

PC-B
Desktop -> IP-configuration
IP-address: 192.168.30.13
Subnet Mask: 255.255.255.0
# Part 2: Create VLANs  and Assign  Switch Ports
S1(config)# vlan 10
S1(config-vlan)#name Management
S1(config-vlan)#vlan 20
S1(config-vlan)#name Sales
S1(config-vlan)#vlan 30
S1(config-vlan)#name Operations
S1(config-vlan)#vlan 999
S1(config-vlan)#name ParkingLot
S1(config-vlan)#vlan 1000
S1(config-vlan)#Name Native
S1(config-vlan)#end

S2(config)#vlan 10
S2(config-vlan)#name Management
S2(config-vlan)#vlan 30 
S2(config-vlan)#name Operations
S2(config-vlan)#vlan 999
S2(config-vlan)#name ParkingLot
S2(config-vlan)#vlan 1000
S2(config-vlan)#name Native

S1(config)#interface vlan 10
S1(config-if)#ip address 192.168.10.11 255.255.255.0
S1(config-if)#no shutdown
S1(config-if)#interface vlan 20
S1(config-if)#ip address 192.168.20.11 255.255.255.0
S1(config-if)#no shutdown
S1(config-if)#interface vlan 30
S1(config-if)#ip address 192.168.30.11 255.255.255.0
S1(config-if)#no shutdown 

S2(config)#interface vlan 10
S2(config-if)#ip address 192.168.10.12 255.255.255.0

S1(config)#interface range F0/2-5
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 999
S1(config-if-range)#shutdown
S1(config)#interface range F0/7-24
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 999
S1(config-if-range)#shutdown
S1(config)#interface range gigabitEthernet 0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 999
S1(config-if-range)#shutdown

S2(config)#interface range f0/2-17
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 999
S2(config-if-range)#shutdown
S2(config-if-range)#interface range f0/19-24
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 999
S2(config-if-range)#shutdown
S2(config-if-range)#interface range g0/1-2
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 999
S2(config-if-range)#shutdown

S1(config)#interface fastEthernet 0/6
S1(config-if)#switchport mode access 
S1(config-if)#switchport access vlan 20
S1(config-if)#no shutdown 

S2(config)#interface fastEthernet 0/18
S2(config-if)#switchport mode access 
S2(config-if)#switchport access vlan 30
S2(config-if)#no shutdown
S1# show vlan brief
S12 show vlan brief

# Part 3: Configure  an 802.1Q  Trunk  Between  the Switches
S1(config)#interface f0/1
S1(config-if)#switchport mode trunk 

S2(config)#interface fastEthernet 0/1
S2(config-if)#switchport mode trunk 

S1(config-if)#switchport trunk native vlan 1000

S2(config-if)#switchport trunk native vlan 1000
S2(config-if)#switchport trunk allowed vlan 10,20,30,1000

S1# show interfaces trunk
S2# show interfaces trunk

Were the pings from PC-B to S2 successful?
Switches and pc's can only ping to eachother when they're in the same vlan.
S2 only ha a vlan 10 interface with 192.168.10.12 and can thus not ping or be pinged by PC-B address 192.168.30.13