# Lab - Configure Router-on-a-Stick Inter-VLAN Routing

## Part 1: Build the Network and Configure Basic Device Settings

Take a 3221 router.
Connect a 2960 switch to the router R1 with a copper straight through on G0/0/1 to F0/5.
Connect a 2960 switch S2 to switch S1 with a copper cross cable on F0/1 to F0/1.
Add a pc and connect it to S1 with a copper straight through cable on F0/6
Add a pc and connect it to S2 with a copper straight through cable on F0/18
R1
Router> enable
Router# conf t
R1(config) # hostname R1
R1(config) # no ip domain-lookup (to test this show run | include domain-lookup)
R1(config) # enable secret class
R1(config) # line con 0
R1(config-line) # password cisco
R1(config-line) # login
R1(config-line) # line vty 0 15
R1(config-line) # password cisco
R1(config-line) # login
R1(config-line) # exit
R1(config) # service password-encryption
R1(config) # banner motd "Unauthorized access is prohibited!"
R1(config) # exit
R1# copy running-config startup-config
R1# clock set 11:45:20 27 May 2020

S1
Switch> enable
Switch# conf t
S1(config) # hostname R1
S1(config) # no ip domain-lookup (to test this show run | include domain-lookup)
S1(config) # enable secret class
S1(config) # line con 0
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # line vty 0 15
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # exit
S1(config) # service password-encryption
S1(config) # banner motd "Unauthorized access is prohibited!"
S1(config) # exit
S1# copy running-config startup-config
S1# clock set 11:45:20 27 May 2020

S2
Switch> enable
Switch# conf t
S2(config) # hostname S2
S2(config) # no ip domain-lookup
S2(config) # enable secret class
S2(config) # line con 0
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # line vty 0 15
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # exit
S2(config) # service password-encryption
S2(config) # banner motd "Unauthorized access is prohibited!"
S2(config) # exit
S2# copy running-config startup-config
S2# clock set 11:45:20 27 May 2020

PC-A
Desktop -> IP-configuration
IP-address: 192.168.3.3
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.3.1

PC-B
Desktop -> IP-configuration
IP-address: 192.168.4.3
Subnet Mask: 255.255.255.0
Default Gateway: 192.168.4.1

## Part 2: Create VLANs and Assign Switch Ports

S1(config)# vlan 3
S1(config-vlan)#name Management
S1(config-vlan)#vlan 4
S1(config-vlan)#name Operations
S1(config-vlan)#vlan 7
S1(config-vlan)#name ParkingLot
S1(config-vlan)#vlan 8
S1(config-vlan)#name Native
S1(config-vlan)#end

S2(config)# vlan 3
S2(config-vlan)#name Management
S2(config-vlan)#vlan 4
S2(config-vlan)#name Operations
S2(config-vlan)#vlan 7
S2(config-vlan)#name ParkingLot
S2(config-vlan)#vlan 8
S2(config-vlan)#name Native
S2(config-vlan)#end

S1(config)#interface vlan 3
S1(config-if)#ip address 192.168.3.11 255.255.255.0
S1(config-if)#no shutdown
S1(config-if)#exit
S1(config)# ip default-gateway 192.168.3.1

S2(config)#interface vlan 3
S2(config-if)#ip address 192.168.3.11 255.255.255.0
S2(config-if)#no shutdown
S2(config-if)#exit
S2(config)# ip default-gateway 192.168.4.1

S1(config)#interface range Fa 0/2-4, fa 0/7-24, g0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 7
S1(config-if-range)#shutdown
S1(config)#interface fa 0/6

S2(config)#interface range fa 0/2-17, fa 0/19-24, g0/1-2
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 7
S2(config-if-range)#shutdown
S2(config-if)#interface fa 0/18
S2(config-if)#switchport mode access
S2(config-if)#switchport access vlan 4

S1# show vlan brief
S12 show vlan brief

## Part 3: Configure an 802.1Q Trunk Between the Switches

S1(config)#interface f0/1
S1(config-if)#switchport mode trunk

S2(config)#interface fastEthernet 0/1
S2(config-if)#switchport mode trunk

S1(config-if)#switchport trunk native vlan 8
S1(config-if)#do show inter trunk
S1(config-if)#switchport trunk allowed vlan remove 1
S1(config-if)#switchport trunk allowed vlan remove 7
S1(config-if)#do show inter trunk

S2(config-if)#switchport trunk native vlan 8
S2(config-if)#do show inter trunk
S2(config-if)#switchport trunk allowed vlan remove 1
S2(config-if)#switchport trunk allowed vlan remove 7

S1# show interfaces trunk
S2# show interfaces trunk

S1(config-if)#do show inter trunk
S1(config-if)#do show inter trunk
S1(config-if)#switchport mode trunk
S1(config-if)#end
S1#copy running-config startup-config

S2#copy running-config startup-config
F0/5 is not appearing is administratively down

## Part 4: Configure Inter-VLAN Routing on the Router

R1(config)#interface gigabitEthernet 0/0/1
R1(config-if)#no shutdown
R1(config)#interface g0/0/1.3
R1(config-subif)#description Management_Network
R1(config-subif)#encapsulation dot1Q 3
R1(config-subif)#ip address 192.168.3.1 255.255.255.0

R1(config)#interface g0/0/1.4
R1(config-subif)#description Operations_Network
R1(config-subif)#encapsulation dot1Q 4
R1(config-subif)#ip address 192.168.4.1 255.255.255.0

R1(config)#interface g/0/0/1.8
R1(config-subif)#description Native_VLAN
R1(config-subif)#encapsulation dot1Q 8 native
R1#show ip interface brief

## Part 5: Verify Inter-VLAN Routing is working

PC-A
C:\>ipconfig /all
C:\>ping 192.168.3.1
C:\>ping 192.168.4.3
C:\>ping 192.168.3.11

PC-B
C:\>tracert 192.168.3.3
C:\>ping 192.168.3.3
C:\>ping 192.168.3.11
