# Packet Tracer - Troubleshoot Inter-VLAN Routing

## Part 1: Locate the Network Problems

Commands you may find useful include:
R1# show ip interface brief
R1# show interface g0/1.10
R1# show interface g0/1.30
S1# show interface trunk

Problem: PC3 default gateway is wrong
desktop-> IP Configuration -> Default Gateway 172.17.30.1
Problem: G0/1.10 is administratively down
Solution:
R1(config)#interface gigabitEthernet 0/1.10
R1(config-subif)#no shutdown

S1#show  interfaces gigabitEthernet 0/1 switchport
Problem: G0/1 is not in switchport mode trunk
Solution:
S1(config-if)#switchport mode trunk

R1(config)#do show interface g0/1.10
R1(config)#do show interface g0/1.30
Problem: VLAN's are mismatched
Solution:
R1(config-subif)#interface g0/1.10
R1(config-subif)#encapsulation dot1Q 10
R1(config-subif)#shutdown
R1(config-subif)#no shutdown
R1(config-subif)#do show interface g0/1.30

R1(config-subif)#interface g0/1.30
R1(config-subif)#encapsulation dot1Q 30
R1(config-subif)#shutdown
R1(config-subif)#no shutdown
R1(config-subif)#do show interface g0/1.10

R1(config)#do show run (look at IP addresses)
problem: after doing this g0/1 lost ip addresses
solution:
R1(config)#interface gigabitEthernet 0/1.10
R1(config-subif)#ip address 172.127.10.1 255.255.255.0
R1(config)#interface gigabitEthernet 0/1.30
R1(config-subif)#ip address 172.127.30.1 255.255.255.0

## Part 2: Implement the Solutions

S1(config)# vlan 3
S1(config-vlan)#name Management
S1(config-vlan)#vlan 4
S1(config-vlan)#name Operations
S1(config-vlan)#vlan 7
S1(config-vlan)#name ParkingLot
S1(config-vlan)#vlan 8
S1(config-vlan)#name Native
S1(config-vlan)#end

S2(config)# vlan 3
S2(config-vlan)#name Management
S2(config-vlan)#vlan 4
S2(config-vlan)#name Operations
S2(config-vlan)#vlan 7
S2(config-vlan)#name ParkingLot
S2(config-vlan)#vlan 8
S2(config-vlan)#name Native
S2(config-vlan)#end

S1(config)#interface vlan 3
S1(config-if)#ip address 192.168.3.11 255.255.255.0
S1(config-if)#no shutdown
S1(config-if)#exit
S1(config)# ip default-gateway 192.168.3.1

S2(config)#interface vlan 3
S2(config-if)#ip address 192.168.3.11 255.255.255.0
S2(config-if)#no shutdown
S2(config-if)#exit
S2(config)# ip default-gateway 192.168.4.1

S1(config)#interface range Fa 0/2-4, fa 0/7-24, g0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 7
S1(config-if-range)#shutdown
S1(config)#interface fa 0/6

S2(config)#interface range fa 0/2-17, fa 0/19-24, g0/1-2
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 7
S2(config-if-range)#shutdown
S2(config-if)#interface fa 0/18
S2(config-if)#switchport mode access
S2(config-if)#switchport access vlan 4

S1# show vlan brief
S12 show vlan brief

## Part 3: Verify Network Connectivity

S1(config)#interface f0/1
S1(config-if)#switchport mode trunk

S2(config)#interface fastEthernet 0/1
S2(config-if)#switchport mode trunk

S1(config-if)#switchport trunk native vlan 8
S1(config-if)#do show inter trunk
S1(config-if)#switchport trunk allowed vlan remove 1
S1(config-if)#switchport trunk allowed vlan remove 7
S1(config-if)#do show inter trunk

S2(config-if)#switchport trunk native vlan 8
S2(config-if)#do show inter trunk
S2(config-if)#switchport trunk allowed vlan remove 1
S2(config-if)#switchport trunk allowed vlan remove 7

S1# show interfaces trunk
S2# show interfaces trunk

S1(config-if)#do show inter trunk
S1(config-if)#do show inter trunk
S1(config-if)#switchport mode trunk
S1(config-if)#end
S1#copy running-config startup-config

S2#copy running-config startup-config
F0/5 is not appearing is administratively down

## Part 4: Configure Inter-VLAN Routing on the Router

R1(config)#interface gigabitEthernet 0/0/1
R1(config-if)#no shutdown
R1(config)#interface g0/0/1.3
R1(config-subif)#description Management_Network
R1(config-subif)#encapsulation dot1Q 3
R1(config-subif)#ip address 192.168.3.1 255.255.255.0

R1(config)#interface g0/0/1.4
R1(config-subif)#description Operations_Network
R1(config-subif)#encapsulation dot1Q 4
R1(config-subif)#ip address 192.168.4.1 255.255.255.0

R1(config)#interface g/0/0/1.8
R1(config-subif)#description Native_VLAN
R1(config-subif)#encapsulation dot1Q 8 native
R1#show ip interface brief

## Part 5: Verify Inter-VLAN Routing is working

PC-A
C:\>ipconfig /all
C:\>ping 192.168.3.1
C:\>ping 192.168.4.3
C:\>ping 192.168.3.11

PC-B
C:\>tracert 192.168.3.3
C:\>ping 192.168.3.3
C:\>ping 192.168.3.11
