# Lab - Implement EtherChannel

## Part 1: Build the Network and Configure Basic Device Settings

### Step 1: Cable the network as shown in the topology

PC-A straight to S1 on F0/6
S1 cross to S2 on F0/1 F0/1
S1 cross to S2 on F0/2 F0/2
S2 straight to PC-B on F0/18

### Step 2: Configure basic settings for each switch

Switch(config)#hostname S1
S1(config) # no ip domain-lookup (to test this show run | include domain-lookup)
S1(config) # enable secret class
S1(config) # line con 0
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # line vty 0 15
S1(config-line) # password cisco
S1(config-line) # login
S1(config-line) # exit
S1(config) # service password-encryption
S1(config) # banner motd "Unauthorized access is prohibited!"
S1(config) # exit
S1# copy running-config startup-config
S1#clock set 18:32:50 28 May 2020
S1# copy running-config startup-config

S2(config) # hostname S2
S2(config) # no ip domain-lookup
S2(config) # enable secret class
S2(config) # line con 0
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # line vty 0 15
S2(config-line) # password cisco
S2(config-line) # login
S2(config-line) # exit
S2(config) # service password-encryption
S2(config) # banner motd "Unauthorized access is prohibited!"
S2(config) # exit
S2# copy running-config startup-config
S2#clock set 18:32:50 28 May 2020
S2# copy running-config startup-config

### Step 3: Configure PC hosts

go to ip-configuration and give in the ip-address per pc

## Part 2: Create VLANs and Assign Switch Ports

### Step 1: Create VLANs on the switches

S1(config)#vlan 10
S1(config-vlan)#name Management
S1(config-vlan)#vlan 20
S1(config-vlan)#name Clients
S1(config-vlan)#vlan 999
S1(config-vlan)#name Parking_Lot
S1(config-vlan)#vlan 1000
S1(config-vlan)#name Native

S2(config)#vlan 10
S2(config-vlan)#name Management
S2(config-vlan)#vlan 20
S2(config-vlan)#name Clients
S2(config-vlan)#vlan 999
S2(config-vlan)#name Parking_Lot
S2(config-vlan)#vlan 1000
S2(config-vlan)#name Native

S1(config)#interface vlan 10
S1(config-if)#ip address 192.168.10.11 255.255.255.0
S1(config-if)#no shutdown

S2(config)#interface vlan 10
S2(config-if)#ip address 192.168.10.12 255.255.255.0
S2(config-if)#no shutdown

S1(config)#interface range fastEthernet 0/3-5, fastEthernet 0/7-24, gigabitEthernet 0/1-2
S1(config-if-range)#switchport mode access
S1(config-if-range)#switchport access vlan 999
S1(config-if-range)#shutdown

S2(config)#interface range fastEthernet 0/3-17, fastEthernet 0/19-24, gigabitEthernet 0/1-2
S2(config-if-range)#switchport mode access
S2(config-if-range)#switchport access vlan 999
S2(config-if-range)#shutdown

### Step 2: Assign VLANs to the correct switch interfaces

S1(config)#interface fastEthernet 0/6
S1(config-if)#switchport mode access
S1(config-if)#switchport access vlan 20
S1(config-if)#no shutdown
S1#show vlan brief

S2(config)#interface fastEthernet 0/18
S2(config-if)#switchport mode access
S2(config-if)#switchport access vlan 20
S2(config-if)#no shutdown
S2#show vlan brief

## Part 3: Configure 802.1Q Trunks between the Switches

S1(config)#interface range f0/1-2
S1(config-if)#switchport mode trunk
S1(config-if-range)#switchport trunk native vlan 1000

S2(config)#interface range fastEthernet 0/1-2
S2(config-if-range)#switchport mode trunk
S2(config-if-range)#switchport trunk native vlan

S1(config-if)#do show inter trunk
S1(config-if)#switchport trunk allowed vlan remove 1
S1(config-if)#switchport trunk allowed vlan remove 7
S1(config-if)#do show inter trunk

S2(config-if)#switchport trunk native vlan 8
S2(config-if)#do show inter trunk
S2(config-if)#switchport trunk allowed vlan remove 1
S2(config-if)#switchport trunk allowed vlan remove 7

S1# show interfaces trunk
S2# show interfaces trunk

S1(config-if)#do show inter trunk
S1(config-if)#do show inter trunk
S1(config-if)#switchport mode trunk
S1(config-if)#end
S1#copy running-config startup-config

S2(config-if)#do show inter trunk
S2(config-if-range)#switchport trunk allowed vlan remove 1
S2(config-if-range)#switchport trunk allowed vlan remove 999
S2#copy running-config startup-config

The Vlan in spanning tree forwarding state and not prned entry is different for F0/1 and F0/2 is different because for example f0/1 is going to the root bridge. The other port is redundant and is therefore blocked.

## Part 4: Implement and Verify an EtherChannel between ## the switches

S1(config)#interface range fastEthernet 0/1 - 2
S1(config-if-range)#channel-group 1 mode active
S1(config)#interface port-channel 1
S1(config-if)#switchport mode trunk
S1(config-if)#switchport trunk allowed vlan 10,20,1000
S1#show interfaces trunk
Fun fact no trunks pop up now, because S2 is not configured as a port channel yet

S2(config)#interface range fastEthernet 0/1-2
S2(config-if-range)#channel-group 1 mode active
S2(config-if)#switchport mode trunk
S2(config-if)#switchport trunk allowed vlan 10,20,1000
S2#show interfaces trunk
S2#show etherchannel summary

Po1 represents the port channel 1
