# Lab - Implement DHCPv4

## Part 1: Build the Network and Configure Basic Device Settings

### Step 1: Establish an addressing scheme

See Excel

### Step 2: Cable the network as shown in the topology

PC-A S1: Straight F0/6  
S1 R1: Straight F0/5 G0/0/1  
R1 R2: Cross G0/0/0 G0/0/0  
R2 S2: Straight G0/0/1 F0/5  
S2 PC-B: Straight F0/18  

### Step 3: Configure basic settings for each router

Router(config)#hostname R1  
R1(config)#no ip domain-lookup  
R1(config)#enable secret class  
R1(config)#line console 0
R1(config-line)#password cisco  
R1(config-line)#login  
R1(config)#line vty 0 15  
R1(config-line)#password cisco  
R1(config-line)#login  
R1(config)#service password-encryption  
R1(config)#banner motd "Unauthorized access is prohibited!"  
R1#copy running-config startup-config  
R1#clock set 13:14:30 30 May 2020  

Router(config)#hostname R2  
R2(config)#no ip domain-lookup  
R2(config)#enable secret class  
R2(config-line)#password cisco  
R2(config-line)#login  
R2(config-line)#password cisco  
R2(config-line)#login  
R2(config)#service password-encryption  
R2(config)#banner motd "Unauthorized access is prohibited!"
R2#copy running-config startup-config  
R2#clock set 13:19:30 30 May 2020  

### Step 4: Configure Inter-VLAN Routing on R1

R1(config)#interface gigabitEthernet 0/0/1.100  
R1(config-subif)#encapsulation dot1Q 100  
R1(config-subif)#ip address 192.168.1.1 255.255.255.192  
R1(config-subif)#description Clients  
R1(config)#interface gigabitEthernet 0/0/1.200  
R1(config-subif)#encapsulation dot1Q 200  
R1(config-subif)#ip address 192.168.1.65 255.255.255.224  
R1(config-subif)#description Management  
R1(config)#interface gigabitEthernet 0/0/1.1000  
R1(config-subif)#encapsulation dot1Q 1000 native  
R1(config-subif)#description Native  
R1(config-subif)#int g0/0/1  
R1(config-if)#no shutdown  

### Step 5: Configure G0/0/1 on R2, then G0/0/0 and static routing for both routers

R2(config)#interface gigabitEthernet 0/0/0  
R2(config-if)#ip address 10.0.0.2 255.255.255.252  
R2(config-if)#no shutdown  
R2(config-if)#int g0/0/1  
R2(config-if)#ip address 192.168.1.97 255.255.255.240  
R2(config-if)#no shutdown  

R1(config-if)#int g0/0/0  
R1(config-if)#ip address 10.0.0.1 255.255.255.252  
R1(config-if)#no shutdown  
R1(config)#ip route 0.0.0.0 0.0.0.0 10.0.0.2  

R2(config)#ip route 0.0.0.0 0.0.0.0 10.0.0.1  

R1#ping 192.168.1.97
R1#copy running-config startup-config  

R2#copy running-config startup-config  

### Step 6: Configure basic settings for each switch

Switch(config)#hostname S1  
S1(config)#no ip domain-lookup  
S1(config)#enable secret class  
S1(config)#line con 0  
S1(config-line)#password cisco  
S1(config-line)#login  
S1(config)#line vty 0 15  
S1(config-line)#password cisco  
S1(config-line)#login  
S1(config)#service password-encryption  
S1(config)#banner Motd "Unauthorized Access is prohibited!"  
S1#copy running-config startup-config  
S1#clock set 14:22:30 30 May 2020  
S1#copy running-config startup-config  

Switch(config)#hostname S2  
S2(config)#no ip domain-lookup  
S2(config)#enable secret class  
S2(config)#line con 0  
S2(config-line)#password cisco  
S2(config-line)#login  
S2(config-line)#line vty 0 15  
S2(config-line)#password cisco  
S2(config-line)#login  
S2(config)#service password-encryption  
S2(config)#banner motd "Unauthorized access is prohibited!"  
S2#copy running-config startup-config  
S2#clock set 14:27:30 30 May 2020  
S2#copy running-config startup-config  

### Step 7: Create VLANs on S1

S1(config)#vlan 100  
S1(config-vlan)#name Clients  
S1(config-vlan)#vlan 200  
S1(config-vlan)#name Management  
S1(config-vlan)#vlan 999  
S1(config-vlan)#name Parking_Lot  
S1(config-vlan)#vlan 1000  
S1(config-vlan)#name Native  
S1(config)#interface vlan 200  
S1(config-if)#ip address 192.168.1.66 255.255.255.224  
S1(config-if)#no shut  
S1(config)#ip default-gateway 192.168.1.65  

S2(config)#interface vlan 1  
S2(config-if)#ip address 192.168.1.98 255.255.255.240  
S2(config-if)#no shut  
S2(config)#ip default-gateway 192.168.1.97  

S1(config)#int range f0/1-4, f0/7-24, g0/1-2  
S1(config-if-range)#switchport mode access  
S1(config-if-range)#switchport access Vlan 999  
S1(config-if-range)#shutdown  

S2(config)#int range f0/1-4, f0/6-17, f0/19-24, g0/1-2  
S2(config-if-range)#shutdown  

### Step 8: Assign VLANs to the correct switch interfaces

S2(config-if)#switchport mode access  
S2(config-if)#switchport access vlan 1  

S1(config)#interface f0/6  
S1(config-if)#switchport mode access  
S1(config-if)#switchport access vlan 100  
Vlan 200 is already configured when you configured it with the IP-address  
S1#show vlan brief  
Interface F0/5 is listen under VLAN 1 because it has not been configured as a trunk and is thus lsiten under the default vlan. They would self configure with an automatic private ip-address APIPA in 169.254 branch.

### Step 9: Manually configure S1â€™s interface F0/5 as an 802.1Q trunk

S1(config)#int f0/5  
S1(config-if)#switchport mode trunk  
S1(config-if)#switchport trunk native vlan 1000  
S1(config-if)#switchport trunk allowed vlan 100,200,1000  
S1#copy running-config startup-config  
Change the PC Ip-configuration from Static to DHCP

## Part 2: Configure and verify two DHCPv4 Servers on R1

### Step 1: Configure R1 with DHCPv4 pools for the two supported subnets. Only the DHCP Pool for subnet A is given below

R1(config)#ip dhcp excluded-address 192.168.1.1 192.168.1.5  
R1(config)#ip dhcp excluded-address 192.168.1.97 192.168.1.101  
R1(config)#ip dhcp pool VLAN_100  
R1(dhcp-config)#network 192.168.1.0 255.255.255.192  
R1(dhcp-config)#domain-name ccna-lab.com  
R1(dhcp-config)#default-router 192.168.1.1  
R1(dhcp-config)#lease 2 12 30 (Lease is not supported in packet tracer)
R1(config)#ip dhcp pool R2_Client_LAN  
R1(dhcp-config)#network 192.168.1.96 255.255.255.240  
R1(dhcp-config)#default-router 192.168.1.97  
R1(dhcp-config)#domain-name ccna-lab.com
R1(dhcp-config)#lease 2 12 30 (Lease is not supported in packet tracer)

### Step 2: Save your configuration

R1#copy running-config startup-config  
R1#show ip dhcp pool  
PC-A is leasing an ip-address. The default gateway might be missing, this can be fixed by going to static mode and back to dhcp to refresh it.

### Step 3: Verify the DHCPv4 Server configuration

R1#show ip dhcp pool  
R1#show ip dhcp binding  
R1#show ip dhcp server statistics (this command is also not supported by packet tracer)  

### Step 4: Attempt to acquire an IP address from DHCP on PC-A

PC-A  
C:\>ipconfig /renew  
C:\>ipconfig  
C:\>ping 192.168.1.1  

## Part 3: Configure and verify a DHCP Relay on R2

### Step 1: Configure R2 as a DHCP relay agent for the LAN on G0/0/1

R2(config)#int g0/0/1  
R2(config-if)#ip helper-address 10.0.0.1  
R2#copy running-config startup-config  

### Step 2: Attempt to acquire an IP address from DHCP on PC-B

PC-B  
C:\>ipconfig /renew  
C:\>ipconfig  
C:\>ping 192.168.1.6  
C:\>ping 192.168.1.66  
R1#show ip dhcp binding  
