# Lab - Configure DHCPv6

## Part 1: Build the Network and Configure Basic Device Settings

## Step 1: Cable the network as shown in the topology

PC-A S1: Straight F0/6  
S1 R1: Straight F0/5 G0/0/1  
R1 R2: Cross G0/0/0 G0/0/0  
R2 S2: Straight G0/0/1 F0/5  
S2 PC-B: Straight F0/18  

## Step 2: Configure basic settings for each switch. (Optional)

It's optional, we've done it so many times already so let's skip this part.  

Switch(config)#hostname S1  
Switch(config)#hostname S2  

## Step 3: Configure basic settings for each router

Router(config)#hostname R1  
R1(config)#no ip domain-lookup  
R1(config)#enable secret class  
R1(config)#line con 0  
R1(config-line)#password cisco  
R1(config-line)#login  
R1(config-line)#line vty 0 15  
R1(config-line)#password cisco  
R1(config-line)#login  
R1(config)#service password-encryption  
R1(config)#banner motd "Unauthorized access is prohibited!"  
R1(config)#ipv6 unicast-routing  
R1#copy running-config startup-config  

Router(config)#hostname R2  
R2(config)#ipv6 unicast-routing  
R2#copy running-config startup-config  

## Step 4: Configure interfaces and routing for both routers

R1(config)#int g0/0/0  
R1(config-if)#ipv6 address 2001:db8:acad:2::1/64  
R1(config-if)#ipv6 address fe80::1 link-local  
R1(config-if)#no shutdown  
R1(config)#int g0/0/1  
R1(config-if)#ipv6 address 2001:db8:acad:1::1/64  
R1(config-if)#ipv6 address fe80::1 link-local  
R1(config-if)#no shutdown  

R2(config)#int g0/0/0  
R2(config-if)#ipv6 address  2001:db8:acad:2::2/64  
R2(config-if)#ipv6 address fe80::2 link-local  
R2(config-if)#no shutdown  
R2(config)#int g0/0/1  
R2(config-if)#ipv6 address 2001:db8:acad:3::1/64  
R2(config-if)#ipv6 address fe80::1 link-local  
R2(config-if)#no shutdown  

R1(config)#ipv6 route ::/0 2001:db8:acad:2::2  
R2(config)#ipv6 route ::/0 2001:db8:acad:2::1  

R1#ping 2001:db8:acad:3::1  
R1#copy running-config startup-config  
R2#copy running-config startup-config  

## Part 2: Verify SLAAC address assignment from R1

PC-A  
C:\>ipconfig  

## Part 3: Configure and verify a Stateless DHCPv6 Server on R1

### Step 1: Examine the configuration of PC-A in more detail

PC-A  
C:\>ipconfig /all  

### Step 2: Configure R1 to provide stateless DHCPv6 for PC-A

R1(config)#ipv6 dhcp pool R1-STATELESS  
R1(config-dhcpv6)#dns-server 2001:db8:acad::254  
R1(config-dhcpv6)#domain-name STATELESS.com  
R1(config)#interface g0/0/1  
R1(config-if)#ipv6 nd other-config-flag  
R1(config-if)#ipv6 dhcp server R1-STATELESS  
R1#copy running-config startup-config  

The task wants us to restart the pc, but in the current version of packet tracer that's not possible. A fix for this is to shut down the interface of the pc and turn it back on again. So in this example we're going to turn off f0/6, which is the connection between PC-A S1.  
S1(config)#int f0/6
S1(config-if)#shut
S1(config-if)#no shut

PC-A  
C:\>ipconfig /all  

## Part 4: Configure and verify a Stateful DHCPv6 Server on R1

R1(config)#ipv6 dhcp pool R2-STATEFUL  
R1(config-dhcpv6)#address prefix 2001:db8:acad:3:aaa::/80  
R1(config-dhcpv6)# dns-server 2001:db8:acad::254  
R1(config-dhcpv6)#domain-name STATEFUL.com  
R1(config)#int g0/0/0  
R1(config-if)#ipv6 dhcp server R2-STATEFUL  

## Part 5: Configure and verify a DHCPv6 Relay on R2

### Step 1: Power on PC-B and examine the SLAAC address that it generates

PC-B  
C:\>ipconfig /all  

### Step 2: Configure R2 as a DHCP relay agent for the LAN on G0/0/1

R2(config)# interface g0/0/1
R2(config-if)# ipv6 nd managed-config-flag
R2(config-if)# ipv6 dhcp relay destination 2001:db8:acad:2::1 g0/0/0
> **Note:** ipv6 relays do not seem to work in packet tracer.

### Step 3: Attempt to acquire an IPv6 address from DHCPv6 on PC-B

PC-B  
C:\>ipconfig /all
